# Задача 5 Посчитайте сумму чётных элементов от 1 до n исключая кратные e.

# e = 3
# n = 100
# i = 1
# summa = 0
# while i < n:
#     if i % 2 == 0 and i % e != 0:
#         summa += i
#     i += 1
# print(summa)


# ------------------------------------------------------
# Задача 6 Напишите программу, которая запрашивает год и проверяет его на високосность.

# year = int(input("Введите год: "))
# if (year % 4 == 0 and year%100 != 0) or (year%400 == 0):
#     print("Высокосный")
# else:
#     print("Обычный")

